#### WaterTintEnableType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "WaterTintEnable" from the "Water" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum WaterTintEnableType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WaterTintEnableType ``` |

| Visual C++ |
| --- |
| ``` public enum class WaterTintEnableType ``` |

# Members

| Member name | Description |
| --- | --- |
| Tropical |  |
| Algae |  |
| Murky |  |
| ReflectingPool |  |
| River |  |
| Lake |  |
| Ocean |  |
| Custom |  |

# See Also

Autodesk.Revit.DB.Visual Namespace